Revit 2026 API

# NonContinuousRailInfo Methods

---

The NonContinuousRailInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidNonContinuousRailHeight | Checks whether the input height is valid for a non-continuous rail in its associated railing type. |
|  | IsValidNonContinuousRailMaterial | Checks whether an ElementId is a valid material Id of a non-continuous rail. |
|  | IsValidNonContinuousRailName | Checks whether the input name is valid for a non-continuous rail in its associated railing type. |
|  | IsValidNonContinuousRailProfile | Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

NonContinuousRailInfo Class

Autodesk.Revit.DB.Architecture Namespace